{"id":14171,"date":"2019-08-30T21:05:00","date_gmt":"2019-08-30T21:05:00","guid":{"rendered":"http:\/\/3.13.162.80\/?p=14171"},"modified":"2019-09-09T21:07:08","modified_gmt":"2019-09-09T21:07:08","slug":"tasi-group-acquires-innomtec","status":"publish","type":"post","link":"https:\/\/tasigroup.com\/tasi-group-acquires-innomtec\/","title":{"rendered":"TASI Group Grows Global Leak Test Capabilities with Germany’s Innomatec"},"content":{"rendered":"<p><a href=\"https:\/\/www.innomatec.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-14172\" src=\"https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Logo-Capture.jpg\" alt=\"\" width=\"209\" height=\"75\" \/><\/a><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-14173\" src=\"https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Capture-300x109.jpg\" alt=\"\" width=\"700\" height=\"254\" srcset=\"https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Capture-300x109.jpg 300w, https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Capture-768x279.jpg 768w, https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Capture-1024x372.jpg 1024w, https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Capture-1280x465.jpg 1280w, https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Capture-600x218.jpg 600w, https:\/\/tasigroup.com\/wp-content\/uploads\/2019\/09\/Innomatec-Capture.jpg 1903w\" sizes=\"(max-width: 700px) 100vw, 700px\" \/><\/p>\n<p>The TASI Group of Companies (<a href=\"https:\/\/tasigroup.com)\">www.tasigroup.com)<\/a>, has taken ownership of the German leak test company, Innomatec Test (<a href=\"https:\/\/www.innomatec.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">innomatec.com<\/a>), creating the world’s strongest leak test solution provider.<\/p>\n<p>Innomatec will be organized in the TASI Product Integrity Segment, which includes Cincinnati Test Systems (CTS), CTS-Schreiner, Sciemetric, and Sierra CP. This addition will geographically expand the reach of the Division’s leak test business into Europe and enable it to deliver an unmatched combination of technology and expertise to the global market.<\/p>\n<p>CTS-Schreiner will be organized under Innomatec, providing sales, service, and manufacturing resources for Southern Europe from Munich. Mike Schillings, previously the managing director of Innomatec will continue as Managing Director Global of the combined entity. In this role, he will work to expand the core competencies and market reach of the Innomatec team in the areas of special test equipment, development, and production of quick-connector systems and measuring instruments, and automation.<\/p>\n<p>“We are pleased to have Innomatec as part of our organization and are eager to support Mike and his team in continuing their strategy which is fully complementary to TASI,” said <strong>TASI CEO John McKenna. <\/strong>“CTS and Innomatec have followed similar paths over the past 40 years. Each has built a strong engineering team that is focused on solving customer challenges with innovative leak test technology, quick connectors, and custom systems development.”<\/p>\n<p>“Together, we have the comprehensive portfolio of industrial leak testing products to create new opportunities and equip global manufacturers with the capabilities they need for the future” added <strong>Schillings<\/strong>. “Existing customers of CTS, Innomatec, and CTS-Schreiner will benefit from the significant support and operational reach each organization has in North America, Europe, and Asia. I am committed to being a part of the team and look forward to working with new partners who so clearly understand what we do and want to achieve and share our vision for growth.”<\/p>\n<p>“Wherever in the world, our customers operate, they can now choose leak test instruments and test solutions from CTS or Innomatec with added confidence that they will receive full service and support locally,” said <strong>CTS President Kevin Hansell<\/strong>. “They will be the primary beneficiaries as we combine our shared passions for engineering innovative solutions and delivering best-in-class customer service and support.”<\/p>\n<p><strong>About Innomatec Test<\/strong><\/p>\n<p>Innomatec was founded in 1983 with the idea from founder Wolfgang Schillings to replace all traditional leak measuring methods, such as underwater testing, with computer-controlled leak testing devices and procedures. The company has since grown to deliver customized systems and test benches for leak checks, flow monitoring and function tests for water, air, helium, inert gas, and SF6. Innomatec’s client base now includes household names from all sectors of industry, in 18 countries. Learn more at <a href=\"https:\/\/www.innomatec.com\/\">https:\/\/www.innomatec.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The TASI Group of Companies (www.tasigroup.com), has taken ownership of the German leak test company, Innomatec Test (innomatec.com), creating the world’s strongest leak test solution provider. Innomatec will be organized in the TASI Product Integrity Segment, which includes Cincinnati Test Systems (CTS), CTS-Schreiner, Sciemetric, and Sierra CP. This addition will geographically expand the reach of the Division’s leak test business [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[221],"tags":[220],"_links":{"self":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts\/14171"}],"collection":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/comments?post=14171"}],"version-history":[{"count":3,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts\/14171\/revisions"}],"predecessor-version":[{"id":14177,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts\/14171\/revisions\/14177"}],"wp:attachment":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/media?parent=14171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/categories?post=14171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/tags?post=14171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}