{"id":14629,"date":"2021-09-13T14:14:41","date_gmt":"2021-09-13T14:14:41","guid":{"rendered":"http:\/\/3.13.162.80\/?p=14629"},"modified":"2021-09-13T14:55:02","modified_gmt":"2021-09-13T14:55:02","slug":"tasi-group-acquires-dynamic-automation-and-robotics-to-automation-group","status":"publish","type":"post","link":"https:\/\/tasigroup.com\/tasi-group-acquires-dynamic-automation-and-robotics-to-automation-group\/","title":{"rendered":"TASI Group Acquires Dynamic Automation and Robotics to Automation Group"},"content":{"rendered":"<p><a href=\"https:\/\/dynamicautomation.com\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-14631 size-medium\" src=\"https:\/\/tasigroup.com\/wp-content\/uploads\/2021\/09\/dynamic-300x145.png\" alt=\"\" width=\"300\" height=\"145\" srcset=\"https:\/\/tasigroup.com\/wp-content\/uploads\/2021\/09\/dynamic-300x145.png 300w, https:\/\/tasigroup.com\/wp-content\/uploads\/2021\/09\/dynamic.png 400w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/p>\n<p>ATC Automation, owned by a TASI Group of Companies, has reached an agreement to acquire <a href=\"https:\/\/dynamicautomation.com\/\" target=\"_blank\" rel=\"noopener\">Dynamic Automation and Robotics<\/a>, Simi Valley, CA . Dynamic has a solid history of serving customers in the custom automation and robotics market. Dynamic will immediately complement and strengthen the geographic and technology offerings of ATC Automation. With a strong presence on the West Coast, the business will remain in its current location in Simi Valley where Marc Freedman will continue to lead its growth as General Manager.<\/p>\n<p>Dynamic Automation and Robotics, founded in 1986, has flourished over the past decade serving Life Science, Consumer, and Aerospace and Energy markets.<\/p>\n<p>“It is rare to find an automation company that shares our high value of employees and the focus on building world class automation to make our customers successful. I couldn’t be more pleased to join forces with Dynamic. Together we will expand our collective reach to provide more depth in what we offer the customer. I look forward to Marc’s continued leadership and continued growth in the Western US and USMCA markets.” Bill Curran, General Manager ATC Automation<\/p>\n<p>“I am proud of and credit the entire Dynamic team for the hard work that made this merger possible. I’m excited to join Bill and the ATC team and believe ATC’s acquisition of Dynamic provides continued growth opportunity while extending even more value for our customers both in scope and geographic location.” Marc Freedman, President Dynamic Automation &amp; Robotics Dynamics’ installed customer base in Automation and Robotics market is complimentary to ATC Automation and both companies have been experiencing high growth rates with the shortage of skilled workers across the manufacturing space.<\/p>\n<p>The TASI Group is a globally diversified company comprised of four strategic business segments. ATC Automation, one of its holdings in the Automation Segment, is a leader in assembly automation market. All of the TASI companies seek to provide solutions that improve manufacturing processes and deliver value-added results. Leveraging the latest technology advances along with products supported by experienced engineering teams, the company delivers the highest achievable quality and reliability in production environments.<\/p>\n<p>Contact Information:<br \/>\nName: Angela Smith – Marketing and Sales Administrator<br \/>\nOrganization: <a href=\"https:\/\/atcautomation.com\/\" target=\"_blank\" rel=\"noopener\">ATC Automation<\/a><br \/>\nAddress: 101 Mill Dr. Cookeville, TN 38501<br \/>\nPhone: 931.582.5417<\/p>\n","protected":false},"excerpt":{"rendered":"<p>ATC Automation, owned by a TASI Group of Companies, has reached an agreement to acquire Dynamic Automation and Robotics, Simi Valley, CA . Dynamic has a solid history of serving customers in the custom automation and robotics market. Dynamic will immediately complement and strengthen the geographic and technology offerings of ATC Automation. With a strong presence on the West Coast, [&hellip;]<\/p>\n","protected":false},"author":4,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[221],"tags":[220],"_links":{"self":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts\/14629"}],"collection":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/comments?post=14629"}],"version-history":[{"count":6,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts\/14629\/revisions"}],"predecessor-version":[{"id":14637,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/posts\/14629\/revisions\/14637"}],"wp:attachment":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/media?parent=14629"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/categories?post=14629"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/tags?post=14629"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}