{"id":14368,"date":"2019-12-18T21:02:58","date_gmt":"2019-12-18T21:02:58","guid":{"rendered":"http:\/\/3.13.162.80\/?page_id=14368"},"modified":"2023-12-12T16:50:28","modified_gmt":"2023-12-12T16:50:28","slug":"uk-tax-strategy-statement","status":"publish","type":"page","link":"https:\/\/tasigroup.com\/uk-tax-strategy-statement\/","title":{"rendered":"UK Tax Strategy Statement"},"content":{"rendered":"<p style=\"font-weight: 400;\">TASI is a leading global supplier of highly engineered, productivity-enhancing systems and solutions.  It provides test, measurement and assembly solutions through four separate technologically advanced strategic business units, three of those have operations in the UK – Litre Meter, Sepha, Sciemetric Ltd, Sierra CP Engineering Ltd, Pulsar Process Management Ltd, collectively refer to as TASI UK Group.<\/p>\n<p style=\"font-weight: 400;\"><strong>Governance &amp; Risk Management<\/strong><\/p>\n<p style=\"font-weight: 400;\">In a fast-paced tax environment, tax needs to be managed proactively to ensure that we are compliant. We achieve compliance by managing our tax processes and outputs, ensuring that risks are mitigated, and controls operate effectively as well as consulting with tax advisors where necessary. This allows us to have confidence that we operate an effective tax control framework.<\/p>\n<p style=\"font-weight: 400;\">TASI UK Group prioritises speed to market in the competitive and dynamic industry that we operate within. Our finance team supports the business to retain speed to market by providing real-time advice to support commercial decision making, and ensure tax is at the forefront of any business planning discussions. The finance team is also proactively supported by an experienced and qualified group tax function. Additionally, external tax advice is sought where tax law is unclear and subject to interpretation.<\/p>\n<p style=\"font-weight: 400;\">Overall responsibility for tax governance and tax risk management is with the TASI UK Group management and ultimate shareholders. They are responsible for maintaining a robust system of internal control and risk management. Such internal controls and risk management framework supports our approach to strong tax administration that includes accurate and timely filing of returns and payment of taxes.<\/p>\n<p style=\"font-weight: 400;\"><strong>Approach to Tax Planning and Level of Tax Risk<\/strong><\/p>\n<p style=\"font-weight: 400;\">TASI UK Group strives to meet its obligation in paying the amount of tax legally due and adhering to our policies, values and wider business objectives. Our aim to balance all stakeholders’ needs means that any tax planning undertaken relates to sponsoredgovernment initiatives or relates to transactions that are commercially driven rather than tax motivated. Whether compliance, operational, financial or strategic risk associated with UK taxation, our organisation seeks to minimise tax risk for our stakeholders.<\/p>\n<p style=\"font-weight: 400;\">The level of risk TASI UK Group accepts in respect of taxation is consistent with its overall objective of achieving as much certaintyas possible with respect to its tax affairs, requiring a strong technical basis for any tax positions adopted. Where we identify any tax uncertainty or further complexity, we will seek expert external advice to assist with resolving the uncertainty.<\/p>\n<p style=\"font-weight: 400;\">We acknowledge that the elimination of all tax risk is impractical due to the complexity of tax legislation and differences in interpretation that occur. Areas of tax risk are assessed regularly, and appropriate actions are put in place to mitigate any risks that are above our acceptable level of risk. Key stakeholders who have input into risk management are the management and the ultimate shareholders. Other stakeholders expect our activities to be carried out in accordance with tax laws, and do not exert any influence over the tax risks of the business.<\/p>\n<p style=\"font-weight: 400;\">We strive to comply fully with tax laws in all jurisdictions where we operate with the highest integrity. We do not engage in any artificial tax arrangements conceived to avoid, defer or reduce tax. Any tax planning we undertake relates to sponsored government initiatives or relates to transactions that are commercially driven rather than tax motivated.<\/p>\n<p style=\"font-weight: 400;\"><strong>Engaging with UK Tax Authorities<\/strong><\/p>\n<p style=\"font-weight: 400;\">TASI UK Group is committed to a proactive approach to engaging with stakeholders including Her Majesty’s Revenue &amp; Customs (HMRC). A vital part of this is an open and honest relationship with HMRC that includes regular overview and updates of our commercial operations, business developments and associated tax implications. TASI UK Group, therefore, seeks to have aproactive and collaborative working relationship with HMRC. We are committed to robust tax administration including timely filings and payments of taxes.<\/p>\n<p style=\"font-weight: 400;\">The TASI UK Group tax strategy complies with the requirements to publish a UK tax strategy as outlined under paragraph 19(2) of Schedule 19 Finance Act 2016.<\/p>\n<p style=\"font-weight: 400;\">This strategy was approved by the management and Directors of TASI UK Group and applies to the financial year ending 31 December 2023.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>TASI is a leading global supplier of highly engineered, productivity-enhancing systems and solutions.  It provides test, measurement and assembly solutions through four separate technologically advanced strategic business units, three of those have operations in the UK – Litre Meter, Sepha, Sciemetric Ltd, Sierra CP Engineering Ltd, Pulsar Process Management Ltd, collectively refer to as TASI UK Group. Governance &amp; Risk [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/pages\/14368"}],"collection":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/comments?post=14368"}],"version-history":[{"count":4,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/pages\/14368\/revisions"}],"predecessor-version":[{"id":14972,"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/pages\/14368\/revisions\/14972"}],"wp:attachment":[{"href":"https:\/\/tasigroup.com\/wp-json\/wp\/v2\/media?parent=14368"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}